COOP-5/Designing-Data-Intensive-Applications/src/03-Storage-and-Retrieval.org
#+title: Storage And Retrieval
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Introduction
Knowing how a DB handles storage helps when choosing an appropriate
storage engine.

* Data Structures that Power your Database
*Log*: an append-only sequence of records

To efficiently find the value for a particular key, an *index* can be
helpful.
Indexes are derived from the primary data.

Indexes are additional to the primary data, which has overhead.
Indexes speed up reads but slow down writes.

Application developers should choose indexes manually based on the
application's typical query patterns.

** Hash Indexes
Key-value stores are similar to dictionaries, which are usually
implemented as hash maps.

Can index a key-value store using a hash map to store the
byte offset in the data file where the value can be found.

On writes, write to the hash map as well (based on where data
was inserted).

On reads, read from the hash map to get the offset where the record is.

To avoid running out of space, break log into segments and close a segment
file when it reaches a certain size.
Perform *compaction* on segments, throwing away duplicate keys in the log
and merging segments if possible.
Since segments are never modified after writing, merged segments are
written to a new file.

Each segment has an in-memory hash table, mapping keys to file offsets.
Hash maps are checked in order of recency.

Having logs be append-only helps with speed, concurrency, crash recovery,
and file fragmenting.

Hash table must fit in memory, so cannot have to many keys.
Also, range queries are not efficient (lookups are independent).

** SSTables and LSM-Trees
In an *SSTable*, sort the key-value pairs in each segment by key.

This allows simpler merging, removes the need to keep an index for all
keys in memory, and allows the use of blocks of key-value pairs for
compression.

*** Constructing and Maintaining SSTables
Can use a tree data structure (like red-black tree or AVL tree) so
maintain sorted order.
This structure is maintained in memory, in a *memtable*.

When the memtable reaches some size threshold, it is written to
disk, becoming the most recent segment.

Only issue is with crashes (since memtable in-memory).
Can solve with a log on disk to which every write is appended,
used to restore the memtable after a crash.

*** Making an LSM-Tree out of SSTables
This indexing structure is called an *LSM-Tree*.

*** Performance Optimizations
Use *Bloom filters* to optimize checking if keys do not exist in
the DB.

Types of compaction include:
- *size-tiered*: newer SSTables successively merged into older and
  larger SSTables
- *leveled*: key range split up into smaller SSTables and older
  data moved into separate levels

LSM-Tree works well even when data is bigger than available memory.
Also better at range queries since data is sorted.

