COOP-5/Designing-Data-Intensive-Applications/03-Storage-and-Retrieval.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-27 Mon 00:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Storage And Retrieval</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Storage And Retrieval</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1fe00ec">1. Introduction</a></li>
<li><a href="#orge850b55">2. Data Structures that Power your Database</a>
<ul>
<li><a href="#org24fe0c4">2.1. Hash Indexes</a></li>
<li><a href="#orgb653cf9">2.2. SSTables and LSM-Trees</a>
<ul>
<li><a href="#orgc6357e8">2.2.1. Constructing and Maintaining SSTables</a></li>
<li><a href="#org03d350d">2.2.2. Making an LSM-Tree out of SSTables</a></li>
<li><a href="#org6c10d1a">2.2.3. Performance Optimizations</a></li>
</ul>
</li>
<li><a href="#org941313b">2.3. B-Trees</a>
<ul>
<li><a href="#orgcfd4000">2.3.1. Making B-Trees Reliable</a></li>
<li><a href="#org09850a6">2.3.2. B-Tree Optimizations</a></li>
</ul>
</li>
<li><a href="#orgf8cba82">2.4. Comparing B-Trees and LSM-Trees</a>
<ul>
<li><a href="#orgeec0766">2.4.1. Advantages of LSM-Trees</a></li>
<li><a href="#org284e3dd">2.4.2. Downsides of LSM-Trees</a></li>
</ul>
</li>
<li><a href="#org7a34563">2.5. Other Indexing Structures</a>
<ul>
<li><a href="#orgaaa7a98">2.5.1. Storing Values within the Index</a></li>
<li><a href="#org889bf83">2.5.2. Multi-Column Indexes</a></li>
<li><a href="#org0c18815">2.5.3. Full-Text Search and Fuzzy Indexes</a></li>
<li><a href="#orgb1aaaaa">2.5.4. Keeping Everything in Memory</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf21627b">3. Transaction Processing vs Analytics</a>
<ul>
<li><a href="#orgcdcba43">3.1. Data Warehousing</a>
<ul>
<li><a href="#orgeecef47">3.1.1. Divergence Between OLTP DBs and Data Warehouses</a></li>
</ul>
</li>
<li><a href="#orgd54ba7f">3.2. Stars and Snowflakes: Schemas for Analytics</a></li>
</ul>
</li>
<li><a href="#orgfdc2a31">4. Column-Oriented Storage</a>
<ul>
<li><a href="#orgebf3402">4.1. Column Compression</a>
<ul>
<li><a href="#orgb97f63b">4.1.1. Memory Bandwidth and Vectorized Processing</a></li>
</ul>
</li>
<li><a href="#orgb91a7d9">4.2. Sort Order in Column Storage</a>
<ul>
<li><a href="#org50cc28a">4.2.1. Several Different Sort Orders</a></li>
</ul>
</li>
<li><a href="#org5d60468">4.3. Writing to Column-Oriented Storage</a></li>
<li><a href="#orgb31c3ca">4.4. Aggregation: Data Cubes and Materialized Views</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1fe00ec" class="outline-2">
<h2 id="org1fe00ec"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Knowing how a DB handles storage helps when choosing an appropriate
storage engine.
</p>
</div>
</div>
<div id="outline-container-orge850b55" class="outline-2">
<h2 id="orge850b55"><span class="section-number-2">2.</span> Data Structures that Power your Database</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Log</b>: an append-only sequence of records
</p>

<p>
To efficiently find the value for a particular key, an <b>index</b> can be
helpful.
Indexes are derived from the primary data.
</p>

<p>
Indexes are additional to the primary data, which has overhead.
Indexes speed up reads but slow down writes.
</p>

<p>
Application developers should choose indexes manually based on the
application&rsquo;s typical query patterns.
</p>
</div>
<div id="outline-container-org24fe0c4" class="outline-3">
<h3 id="org24fe0c4"><span class="section-number-3">2.1.</span> Hash Indexes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Key-value stores are similar to dictionaries, which are usually
implemented as hash maps.
</p>

<p>
Can index a key-value store using a hash map to store the
byte offset in the data file where the value can be found.
</p>

<p>
On writes, write to the hash map as well (based on where data
was inserted).
</p>

<p>
On reads, read from the hash map to get the offset where the record is.
</p>

<p>
To avoid running out of space, break log into segments and close a segment
file when it reaches a certain size.
Perform <b>compaction</b> on segments, throwing away duplicate keys in the log
and merging segments if possible.
Since segments are never modified after writing, merged segments are
written to a new file.
</p>

<p>
Each segment has an in-memory hash table, mapping keys to file offsets.
Hash maps are checked in order of recency.
</p>

<p>
Having logs be append-only helps with speed, concurrency, crash recovery,
and file fragmenting.
</p>

<p>
Hash table must fit in memory, so cannot have to many keys.
Also, range queries are not efficient (lookups are independent).
</p>
</div>
</div>
<div id="outline-container-orgb653cf9" class="outline-3">
<h3 id="orgb653cf9"><span class="section-number-3">2.2.</span> SSTables and LSM-Trees</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In an <b>SSTable</b>, sort the key-value pairs in each segment by key.
</p>

<p>
This allows simpler merging, removes the need to keep an index for all
keys in memory, and allows the use of blocks of key-value pairs for
compression.
</p>
</div>
<div id="outline-container-orgc6357e8" class="outline-4">
<h4 id="orgc6357e8"><span class="section-number-4">2.2.1.</span> Constructing and Maintaining SSTables</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Can use a tree data structure (like red-black tree or AVL tree) so
maintain sorted order.
This structure is maintained in memory, in a <b>memtable</b>.
</p>

<p>
When the memtable reaches some size threshold, it is written to
disk, becoming the most recent segment.
</p>

<p>
Only issue is with crashes (since memtable in-memory).
Can solve with a log on disk to which every write is appended,
used to restore the memtable after a crash.
</p>
</div>
</div>
<div id="outline-container-org03d350d" class="outline-4">
<h4 id="org03d350d"><span class="section-number-4">2.2.2.</span> Making an LSM-Tree out of SSTables</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
This indexing structure is called an <b>LSM-Tree</b>.
</p>
</div>
</div>
<div id="outline-container-org6c10d1a" class="outline-4">
<h4 id="org6c10d1a"><span class="section-number-4">2.2.3.</span> Performance Optimizations</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Use <b>Bloom filters</b> to optimize checking if keys do not exist in
the DB.
</p>

<p>
Types of compaction include:
</p>
<ul class="org-ul">
<li><b>size-tiered</b>: newer SSTables successively merged into older and
larger SSTables</li>
<li><b>leveled</b>: key range split up into smaller SSTables and older
data moved into separate levels</li>
</ul>

<p>
LSM-Tree works well even when data is bigger than available memory.
Also better at range queries since data is sorted.
</p>
</div>
</div>
</div>
