COOP-5/Designing-Data-Intensive-Applications/03-Storage-and-Retrieval.tex
% Created 2025-01-27 Mon 00:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Storage And Retrieval}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Storage And Retrieval},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.19)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Introduction}
\label{sec:orgb5fc854}
Knowing how a DB handles storage helps when choosing an appropriate
storage engine.
\section{Data Structures that Power your Database}
\label{sec:org95804f7}
\textbf{Log}: an append-only sequence of records

To efficiently find the value for a particular key, an \textbf{index} can be
helpful.
Indexes are derived from the primary data.

Indexes are additional to the primary data, which has overhead.
Indexes speed up reads but slow down writes.

Application developers should choose indexes manually based on the
application's typical query patterns.
\subsection{Hash Indexes}
\label{sec:org5727b43}
Key-value stores are similar to dictionaries, which are usually
implemented as hash maps.

Can index a key-value store using a hash map to store the
byte offset in the data file where the value can be found.

On writes, write to the hash map as well (based on where data
was inserted).

On reads, read from the hash map to get the offset where the record is.

To avoid running out of space, break log into segments and close a segment
file when it reaches a certain size.
Perform \textbf{compaction} on segments, throwing away duplicate keys in the log
and merging segments if possible.
Since segments are never modified after writing, merged segments are
written to a new file.

Each segment has an in-memory hash table, mapping keys to file offsets.
Hash maps are checked in order of recency.

Having logs be append-only helps with speed, concurrency, crash recovery,
and file fragmenting.

Hash table must fit in memory, so cannot have to many keys.
Also, range queries are not efficient (lookups are independent).
\subsection{SSTables and LSM-Trees}
\label{sec:orgbf26492}
In an \textbf{SSTable}, sort the key-value pairs in each segment by key.

This allows simpler merging, removes the need to keep an index for all
keys in memory, and allows the use of blocks of key-value pairs for
compression.
\subsubsection{Constructing and Maintaining SSTables}
\label{sec:org0c31725}
Can use a tree data structure (like red-black tree or AVL tree) so
maintain sorted order.
This structure is maintained in memory, in a \textbf{memtable}.

When the memtable reaches some size threshold, it is written to
disk, becoming the most recent segment.

Only issue is with crashes (since memtable in-memory).
Can solve with a log on disk to which every write is appended,
used to restore the memtable after a crash.
\subsubsection{Making an LSM-Tree out of SSTables}
\label{sec:orgad03099}
This indexing structure is called an \textbf{LSM-Tree}.
\subsubsection{Performance Optimizations}
\label{sec:orgaaef16d}
Use \textbf{Bloom filters} to optimize checking if keys do not exist in
the DB.

Types of compaction include:
\begin{itemize}
\item \textbf{size-tiered}: newer SSTables successively merged into older and
larger SSTables
\item \textbf{leveled}: key range split up into smaller SSTables and older
data moved into separate levels
\end{itemize}

LSM-Tree works well even when data is bigger than available memory.
Also better at range queries since data is sorted.
