COOP-5/Designing-Data-Intensive-Applications/src/03-Storage-and-Retrieval.org
** B-Trees
Most widely used indexing structure.

DB broken down into fixed-size blocks/pages.
Design corresponds to underlying hardware.

Root of B-Tree is a page and contains keys and references to child pages.
Keys are a continuous range, indicating where boundaries between ranges lie.

A leaf page contains the values or references to the values.

*Branching factor*: number of references to child pages in 1 page of the B-tree

If not enough free space in a page to accommodate a new key, it is split
into two half-full pages.
This ensures the tree remains *balanced*.

A B-Tree with $n$ keys always has depth of $O(\log(n))$.

*** Making B-Trees Reliable
B-Tree write overwrites a page on disk with new data,
but overwrite does not change the location of the page.

To make the DB resilient to crashes, a *write-ahead log*
is used, which is an append only file to which
every B-tree modification must be written before it can be
applied to the pages of the tree itself.

For concurrency, *latches* are used to protect the tree's
data structures.

*** B-Tree Optimizations
Some DBs use a copy-on-write scheme where a modified page is rewritten
to a different location and pointers are updated.

The key can be abbreviated to save space.

Some B-tree implementations place leaf pages in sequential
order on disk.

Some B-trees have sibling pointers.

*Fractal trees* reduce disk seeks.

** Comparing B-Trees and LSM-Trees
LSM-trees are faster for writes, B-trees are faster for reads.

*** Advantages of LSM-Trees
Less writes required due to *write amplification*: one write
to the DB results in multiple writes to the disk.

Sequentially write compact SSTable files rather than overwriting
several pages in the tree.

Better compression and less fragmentation due to compaction.

*** Downsides of LSM-Trees
Compaction can interfere with the performance of ongoing reads
and writes.

Write bandwidth must be shared between the initial write and
compaction threads running in the background.

It is possible that compaction cannot keep up with the rate of
incoming writes, so there are too many segment files.

B-trees are better for transactions.

** Other Indexing Structures
Key-value relies on *primary key*.
*Secondary indexes* are also possible.

A secondary index can be constructed from a key-value index, but
keys are not unique.

*** Storing Values within the Index
*Heap file*: where rows are stored, in no particular order
and no duplicated data

Indexes just reference a location in the heap file.

Records can be overwritten in place in the heap file.

*Clustered index*: store indexed row directly within an
index

*Covering index*: stores some of a table's columns within the
index

Clustered and covering indexes speed up reads but add overhead
on writes.

*** Multi-Column Indexes
*Concatenated index*: combine several fields into one key by
appending one column to another

B-tree and LSM-tree indexes don't answer multi-dimensional queries
efficiently.
R-trees are better for these.

*** Full-Text Search and Fuzzy Indexes
*Fuzzy querying*: searching for similar keys

Can use a SSTable-like structure or use a trie.

*Levenshtein automaton*: supports efficient search for words
within a given edit distance

*** Keeping Everything in Memory
As RAM gets cheaper, this has led to *in-memory databases*.

Some used for caching, some more durable.

Writing to disk is still done for durability, but data is loaded
from memory.

In-memory databases are faster because they avoid overheads
of encoding in-memory data structures in a form that can be
written to disk.

*Anti-caching* allows datasets larger than available memory using a
scheme similar to virtual memory.

* Transaction Processing vs Analytics
*Transaction processing*: low latency reads and writes

Data analytics have different access patterns than transactions.

*Data warehouse*: separate database to run analytics on

** Data Warehousing
Using a data warehouse does not affect OLTP operations
since it is read-only and can be processed through ETL
transformations.

Data warehouse can be optimized for analytic access patterns.

