COOP-5/Designing-Data-Intensive-Applications/03-Storage-and-Retrieval.html
<div id="outline-container-org941313b" class="outline-3">
<h3 id="org941313b"><span class="section-number-3">2.3.</span> B-Trees</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Most widely used indexing structure.
</p>

<p>
DB broken down into fixed-size blocks/pages.
Design corresponds to underlying hardware.
</p>

<p>
Root of B-Tree is a page and contains keys and references to child pages.
Keys are a continuous range, indicating where boundaries between ranges lie.
</p>

<p>
A leaf page contains the values or references to the values.
</p>

<p>
<b>Branching factor</b>: number of references to child pages in 1 page of the B-tree
</p>

<p>
If not enough free space in a page to accommodate a new key, it is split
into two half-full pages.
This ensures the tree remains <b>balanced</b>.
</p>

<p>
A B-Tree with \(n\) keys always has depth of \(O(\log(n))\).
</p>
</div>
<div id="outline-container-orgcfd4000" class="outline-4">
<h4 id="orgcfd4000"><span class="section-number-4">2.3.1.</span> Making B-Trees Reliable</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
B-Tree write overwrites a page on disk with new data,
but overwrite does not change the location of the page.
</p>

<p>
To make the DB resilient to crashes, a <b>write-ahead log</b>
is used, which is an append only file to which
every B-tree modification must be written before it can be
applied to the pages of the tree itself.
</p>

<p>
For concurrency, <b>latches</b> are used to protect the tree&rsquo;s
data structures.
</p>
</div>
</div>
<div id="outline-container-org09850a6" class="outline-4">
<h4 id="org09850a6"><span class="section-number-4">2.3.2.</span> B-Tree Optimizations</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Some DBs use a copy-on-write scheme where a modified page is rewritten
to a different location and pointers are updated.
</p>

<p>
The key can be abbreviated to save space.
</p>

<p>
Some B-tree implementations place leaf pages in sequential
order on disk.
</p>

<p>
Some B-trees have sibling pointers.
</p>

<p>
<b>Fractal trees</b> reduce disk seeks.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf8cba82" class="outline-3">
<h3 id="orgf8cba82"><span class="section-number-3">2.4.</span> Comparing B-Trees and LSM-Trees</h3>
<div class="outline-text-3" id="text-2-4">
<p>
LSM-trees are faster for writes, B-trees are faster for reads.
</p>
</div>
<div id="outline-container-orgeec0766" class="outline-4">
<h4 id="orgeec0766"><span class="section-number-4">2.4.1.</span> Advantages of LSM-Trees</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Less writes required due to <b>write amplification</b>: one write
to the DB results in multiple writes to the disk.
</p>

<p>
Sequentially write compact SSTable files rather than overwriting
several pages in the tree.
</p>

<p>
Better compression and less fragmentation due to compaction.
</p>
</div>
</div>
<div id="outline-container-org284e3dd" class="outline-4">
<h4 id="org284e3dd"><span class="section-number-4">2.4.2.</span> Downsides of LSM-Trees</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Compaction can interfere with the performance of ongoing reads
and writes.
</p>

<p>
Write bandwidth must be shared between the initial write and
compaction threads running in the background.
</p>

<p>
It is possible that compaction cannot keep up with the rate of
incoming writes, so there are too many segment files.
</p>

<p>
B-trees are better for transactions.
</p>
</div>
</div>
</div>
<div id="outline-container-org7a34563" class="outline-3">
<h3 id="org7a34563"><span class="section-number-3">2.5.</span> Other Indexing Structures</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Key-value relies on <b>primary key</b>.
<b>Secondary indexes</b> are also possible.
</p>

<p>
A secondary index can be constructed from a key-value index, but
keys are not unique.
</p>
</div>
<div id="outline-container-orgaaa7a98" class="outline-4">
<h4 id="orgaaa7a98"><span class="section-number-4">2.5.1.</span> Storing Values within the Index</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
<b>Heap file</b>: where rows are stored, in no particular order
and no duplicated data
</p>

<p>
Indexes just reference a location in the heap file.
</p>

<p>
Records can be overwritten in place in the heap file.
</p>

<p>
<b>Clustered index</b>: store indexed row directly within an
index
</p>

<p>
<b>Covering index</b>: stores some of a table&rsquo;s columns within the
index
</p>

<p>
Clustered and covering indexes speed up reads but add overhead
on writes.
</p>
</div>
</div>
<div id="outline-container-org889bf83" class="outline-4">
<h4 id="org889bf83"><span class="section-number-4">2.5.2.</span> Multi-Column Indexes</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
<b>Concatenated index</b>: combine several fields into one key by
appending one column to another
</p>

<p>
B-tree and LSM-tree indexes don&rsquo;t answer multi-dimensional queries
efficiently.
R-trees are better for these.
</p>
</div>
</div>
<div id="outline-container-org0c18815" class="outline-4">
<h4 id="org0c18815"><span class="section-number-4">2.5.3.</span> Full-Text Search and Fuzzy Indexes</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
<b>Fuzzy querying</b>: searching for similar keys
</p>

<p>
Can use a SSTable-like structure or use a trie.
</p>

<p>
<b>Levenshtein automaton</b>: supports efficient search for words
within a given edit distance
</p>
</div>
</div>
<div id="outline-container-orgb1aaaaa" class="outline-4">
<h4 id="orgb1aaaaa"><span class="section-number-4">2.5.4.</span> Keeping Everything in Memory</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
As RAM gets cheaper, this has led to <b>in-memory databases</b>.
</p>

<p>
Some used for caching, some more durable.
</p>

<p>
Writing to disk is still done for durability, but data is loaded
from memory.
</p>

<p>
In-memory databases are faster because they avoid overheads
of encoding in-memory data structures in a form that can be
written to disk.
</p>

<p>
<b>Anti-caching</b> allows datasets larger than available memory using a
scheme similar to virtual memory.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf21627b" class="outline-2">
<h2 id="orgf21627b"><span class="section-number-2">3.</span> Transaction Processing vs Analytics</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Transaction processing</b>: low latency reads and writes
</p>

<p>
Data analytics have different access patterns than transactions.
</p>

<p>
<b>Data warehouse</b>: separate database to run analytics on
</p>
</div>
<div id="outline-container-orgcdcba43" class="outline-3">
<h3 id="orgcdcba43"><span class="section-number-3">3.1.</span> Data Warehousing</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Using a data warehouse does not affect OLTP operations
since it is read-only and can be processed through ETL
transformations.
</p>

<p>
Data warehouse can be optimized for analytic access patterns.
</p>
</div>
