COOP-5/Designing-Data-Intensive-Applications/03-Storage-and-Retrieval.tex
\subsection{B-Trees}
\label{sec:org0906a2a}
Most widely used indexing structure.

DB broken down into fixed-size blocks/pages.
Design corresponds to underlying hardware.

Root of B-Tree is a page and contains keys and references to child pages.
Keys are a continuous range, indicating where boundaries between ranges lie.

A leaf page contains the values or references to the values.

\textbf{Branching factor}: number of references to child pages in 1 page of the B-tree

If not enough free space in a page to accommodate a new key, it is split
into two half-full pages.
This ensures the tree remains \textbf{balanced}.

A B-Tree with \(n\) keys always has depth of \(O(\log(n))\).
\subsubsection{Making B-Trees Reliable}
\label{sec:org4e46680}
B-Tree write overwrites a page on disk with new data,
but overwrite does not change the location of the page.

To make the DB resilient to crashes, a \textbf{write-ahead log}
is used, which is an append only file to which
every B-tree modification must be written before it can be
applied to the pages of the tree itself.

For concurrency, \textbf{latches} are used to protect the tree's
data structures.
\subsubsection{B-Tree Optimizations}
\label{sec:orgad39b2f}
Some DBs use a copy-on-write scheme where a modified page is rewritten
to a different location and pointers are updated.

The key can be abbreviated to save space.

Some B-tree implementations place leaf pages in sequential
order on disk.

Some B-trees have sibling pointers.

\textbf{Fractal trees} reduce disk seeks.
\subsection{Comparing B-Trees and LSM-Trees}
\label{sec:org951d922}
LSM-trees are faster for writes, B-trees are faster for reads.
\subsubsection{Advantages of LSM-Trees}
\label{sec:orgd8d7c6d}
Less writes required due to \textbf{write amplification}: one write
to the DB results in multiple writes to the disk.

Sequentially write compact SSTable files rather than overwriting
several pages in the tree.

Better compression and less fragmentation due to compaction.
\subsubsection{Downsides of LSM-Trees}
\label{sec:org118ee98}
Compaction can interfere with the performance of ongoing reads
and writes.

Write bandwidth must be shared between the initial write and
compaction threads running in the background.

It is possible that compaction cannot keep up with the rate of
incoming writes, so there are too many segment files.

B-trees are better for transactions.
\subsection{Other Indexing Structures}
\label{sec:org0263037}
Key-value relies on \textbf{primary key}.
\textbf{Secondary indexes} are also possible.

A secondary index can be constructed from a key-value index, but
keys are not unique.
\subsubsection{Storing Values within the Index}
\label{sec:org6763982}
\textbf{Heap file}: where rows are stored, in no particular order
and no duplicated data

Indexes just reference a location in the heap file.

Records can be overwritten in place in the heap file.

\textbf{Clustered index}: store indexed row directly within an
index

\textbf{Covering index}: stores some of a table's columns within the
index

Clustered and covering indexes speed up reads but add overhead
on writes.
\subsubsection{Multi-Column Indexes}
\label{sec:org07f6351}
\textbf{Concatenated index}: combine several fields into one key by
appending one column to another

B-tree and LSM-tree indexes don't answer multi-dimensional queries
efficiently.
R-trees are better for these.
\subsubsection{Full-Text Search and Fuzzy Indexes}
\label{sec:orge5fc2de}
\textbf{Fuzzy querying}: searching for similar keys

Can use a SSTable-like structure or use a trie.

\textbf{Levenshtein automaton}: supports efficient search for words
within a given edit distance
\subsubsection{Keeping Everything in Memory}
\label{sec:org3e387f1}
As RAM gets cheaper, this has led to \textbf{in-memory databases}.

Some used for caching, some more durable.

Writing to disk is still done for durability, but data is loaded
from memory.

In-memory databases are faster because they avoid overheads
of encoding in-memory data structures in a form that can be
written to disk.

\textbf{Anti-caching} allows datasets larger than available memory using a
scheme similar to virtual memory.
\section{Transaction Processing vs Analytics}
\label{sec:orga71622a}
\textbf{Transaction processing}: low latency reads and writes

Data analytics have different access patterns than transactions.

\textbf{Data warehouse}: separate database to run analytics on
\subsection{Data Warehousing}
\label{sec:orgd035722}
Using a data warehouse does not affect OLTP operations
since it is read-only and can be processed through ETL
transformations.

Data warehouse can be optimized for analytic access patterns.
