COOP-5/Designing-Data-Intensive-Applications/src/03-Storage-and-Retrieval.org
*** Divergence Between OLTP DBs and Data Warehouses
OLTP and data warehouse have SQL query interface, but internally
are optimized for different query patterns.

** Stars and Snowflakes: Schemas for Analytics
*Star schema*: has fact table that represents events at times and
dimension tables that describe events

*Snowflake schema*: variant of star schema where dimensions are
further broken down into subdimensions (more normalized)

* Column-Oriented Storage
Typical data warehouse query only accesses a small fraction of
columns at a time.

With *column-oriented storage*, all values from a column are stored
together rather than all values from a row.
This can be helpful for fact tables where indexes only exist on a
small number of columns.

Relies on each column file containing rows in the same order.

** Column Compression
Can compress column representation with *bitmap encoding*, where each distinct
value has a bitmap.
This is well suited for the queries common in data warehouses.

*** Memory Bandwidth and Vectorized Processing
Bottlenecks include getting data from disk into memory, efficiently using
bandwidth from main memory into CPU cache, avoiding branch mispredictions, and
making use of SIMD instructions.

With column compression, more rows from a column fit in the same amount of L1
cache.

*Vectorized processing*: operators designed to operate on such chunks of
compressed column data directly

** Sort Order in Column Storage
Order doesn't necessarily matter.

DB admin can choose the columns by which a table should be sorted.

Sorted order can help with column compression, since compression
is strongest on first key.

*** Several Different Sort Orders
Can store redundant data in different ways to use the version
best fit to a query.

** Writing to Column-Oriented Storage
Writes are more difficult in column-oriented storage.

LSM-trees can be used (with compaction) since update in-place
will not work.

Queries need to examine column data on disk and recent writes in memory.

** Aggregation: Data Cubes and Materialized Views
*Materialized view*: copy of query results, written to disk

When underlying data changes, a materialized view needs to be updated.

*Data cube*: grid of aggregates grouped by different dimensions

With a materialized data cube, certain queries become very fast since
they have been precomputed.

Data cube doesn't have the same flexibility as querying raw data.
