COOP-5/Designing-Data-Intensive-Applications/03-Storage-and-Retrieval.html
<div id="outline-container-orgeecef47" class="outline-4">
<h4 id="orgeecef47"><span class="section-number-4">3.1.1.</span> Divergence Between OLTP DBs and Data Warehouses</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
OLTP and data warehouse have SQL query interface, but internally
are optimized for different query patterns.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd54ba7f" class="outline-3">
<h3 id="orgd54ba7f"><span class="section-number-3">3.2.</span> Stars and Snowflakes: Schemas for Analytics</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>Star schema</b>: has fact table that represents events at times and
dimension tables that describe events
</p>

<p>
<b>Snowflake schema</b>: variant of star schema where dimensions are
further broken down into subdimensions (more normalized)
</p>
</div>
</div>
</div>
<div id="outline-container-orgfdc2a31" class="outline-2">
<h2 id="orgfdc2a31"><span class="section-number-2">4.</span> Column-Oriented Storage</h2>
<div class="outline-text-2" id="text-4">
<p>
Typical data warehouse query only accesses a small fraction of
columns at a time.
</p>

<p>
With <b>column-oriented storage</b>, all values from a column are stored
together rather than all values from a row.
This can be helpful for fact tables where indexes only exist on a
small number of columns.
</p>

<p>
Relies on each column file containing rows in the same order.
</p>
</div>
<div id="outline-container-orgebf3402" class="outline-3">
<h3 id="orgebf3402"><span class="section-number-3">4.1.</span> Column Compression</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Can compress column representation with <b>bitmap encoding</b>, where each distinct
value has a bitmap.
This is well suited for the queries common in data warehouses.
</p>
</div>
<div id="outline-container-orgb97f63b" class="outline-4">
<h4 id="orgb97f63b"><span class="section-number-4">4.1.1.</span> Memory Bandwidth and Vectorized Processing</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Bottlenecks include getting data from disk into memory, efficiently using
bandwidth from main memory into CPU cache, avoiding branch mispredictions, and
making use of SIMD instructions.
</p>

<p>
With column compression, more rows from a column fit in the same amount of L1
cache.
</p>

<p>
<b>Vectorized processing</b>: operators designed to operate on such chunks of
compressed column data directly
</p>
</div>
</div>
</div>
<div id="outline-container-orgb91a7d9" class="outline-3">
<h3 id="orgb91a7d9"><span class="section-number-3">4.2.</span> Sort Order in Column Storage</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Order doesn&rsquo;t necessarily matter.
</p>

<p>
DB admin can choose the columns by which a table should be sorted.
</p>

<p>
Sorted order can help with column compression, since compression
is strongest on first key.
</p>
</div>
<div id="outline-container-org50cc28a" class="outline-4">
<h4 id="org50cc28a"><span class="section-number-4">4.2.1.</span> Several Different Sort Orders</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Can store redundant data in different ways to use the version
best fit to a query.
</p>
</div>
</div>
</div>
<div id="outline-container-org5d60468" class="outline-3">
<h3 id="org5d60468"><span class="section-number-3">4.3.</span> Writing to Column-Oriented Storage</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Writes are more difficult in column-oriented storage.
</p>

<p>
LSM-trees can be used (with compaction) since update in-place
will not work.
</p>

<p>
Queries need to examine column data on disk and recent writes in memory.
</p>
</div>
</div>
<div id="outline-container-orgb31c3ca" class="outline-3">
<h3 id="orgb31c3ca"><span class="section-number-3">4.4.</span> Aggregation: Data Cubes and Materialized Views</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<b>Materialized view</b>: copy of query results, written to disk
</p>

<p>
When underlying data changes, a materialized view needs to be updated.
</p>

<p>
<b>Data cube</b>: grid of aggregates grouped by different dimensions
</p>

<p>
With a materialized data cube, certain queries become very fast since
they have been precomputed.
</p>

<p>
Data cube doesn&rsquo;t have the same flexibility as querying raw data.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2025-01-27 Mon 00:32</p>
</div>
</body>
</html>
